# Вариант - SP-сеть
# 1. Побитовый xor для двух одинаковых блоков + функция раундовых ключей как в лаб 2. Тесты.
# 2. Блоки перестановки: P-блок для SP-сети с доп. условиями из задания к лабораторной
# 3. Раундовая функция для SP-сети при помощи S и P-блоков
# 4. Интерфейс с использованием раундовой функции для блочного шифрования - 16 символов вход, ключ, выход
# 5. Составить набор тестов и протестировать диффузию и запутанность. Сделать небольшие выводы.
# По мере выполнения пунктов задания соответствующие пункты выше, после тестирования, удалять
# Использовать методы из второй лабораторной, во временном классе ниже писать только новые необходимые методы

class Lab3TempClass:
    def __init__(self):
        pass
